/*
-------------------------------------------------------------------------------------------------
|          |  vector   |   deque   |   list   |   set    |   multiset  |    map    |   multimap  |   
-------------------------------------------------------------------------------------------------
| 典型内存 |   单端    |   双端    |   双向   |   二叉   |     二叉    |    二叉   |     二叉    |         
|   结构   |   数组    |   数组    |   链表   |    树    |      树     |     树    |      树     | 
 ------------------------------------------------------------------------------------------------
|  可随机  |    是     |    是     |    否    |    否    |      否     | 对key而言 |      否     | 
|   存取   |           |           |          |          |             |    不是   |             |
-------------------------------------------------------------------------------------------------
|   搜寻   |    慢     |    慢     |  非常慢  |    快    |      快     | 对key而言 |   对key而言 |
|   速度   |           |           |          |          |             |    快     |      快     |
 ------------------------------------------------------------------------------------------------
|  可随机  |   尾端    |    头尾   |          |          |             |           |             |
|   存取   |           |    两端   |          |          |             |           |             |
-------------------------------------------------------------------------------------------------
*/
//函数对象本质是一个类的对象，因此称为函数对象，也叫仿函数
//函数对象超出了普通函数的概念，可以拥有自己的状态
#include <iostream>
#include <string>
#include <vector>
#include <string>
#include <algorithm>
using namespace std;
//仿函数
calss MyPrint
{
public:
	void operator()(int num)
	{
		cout << num << endl;

	}
};

void doPrint(MyPrint myPrint, int num)//类名可以传参
{
	myPrint(num);
}
void test03()
{
	doPrint(MyPrint(),1000);
}
int main()
{

}


